Tekla Open API Reference for Tekla Structures 2025
EnumConverter.ConvertFrom Method
[Missing <summary> documentation for "M:Tekla.Structures.Datatype.EnumConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)"]
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override Object ConvertFrom(
	ITypeDescriptorContext context,
	CultureInfo culture,
	Object value
)
Public Overrides Function ConvertFrom (
	context As ITypeDescriptorContext,
	culture As CultureInfo,
	value As Object
) As Object
Parameters
context
Type: System.ComponentModel.ITypeDescriptorContext
[Missing <param name="context"/> documentation for "M:Tekla.Structures.Datatype.EnumConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)"]
culture
Type: System.Globalization.CultureInfo
[Missing <param name="culture"/> documentation for "M:Tekla.Structures.Datatype.EnumConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)"]
value
Type: System.Object
[Missing <param name="value"/> documentation for "M:Tekla.Structures.Datatype.EnumConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Tekla.Structures.Datatype.EnumConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)"]
See Also
Reference
EnumConverter Class
Tekla.Structures.Datatype Namespace